<?php

class Country
{
    private static $mapper = [
        51     => 44,  // Армения
        8      => 34,  // Албания
        398    => 119, // Казахстан
        203    => 265, // Чехия
        233    => 274, // Эстония
        376    => 107, // Израиль
        643    => 204, // Россия
        32     => 43,  // Аргентина
        364    => 112, // Иран
        56     =>  53, // Бельгия
        458    => 156, // Малайзия
        792    => 246, // Турция
        826    => 281, // Англия
        268    => 94,  // Грузия
        380    => 116, // Италия
        724    => 115, // Испания
        250    => 257, // Франция
        616    => 198, // Польша
        620    => 199, // Португалия
        208    => 96,  // Дания
        578    => 181, // Норвегия
        246    => 255, // Финляндия
        752    => 268, // Швеция
        276    => 86,  // Германия
        642    => 206, // Румыния
        100    => 56,  // Болгария
        112    => 52,  // Беларусь
        352    => 114, // Исландия
        528    => 282, // Голландия
        76     => 61,  // Бразилия
        170    => 133, // Колумбия
        218    => 271, // Эквадор
        600    => 196, // Парагвай
        392    => 280, // Япония
        372    => 113, // Ирландия
        292    => 88,  // Гибралтар
        643692 => 222, // Сербия
        484    => 163, // Мексика
        442    => 148, // Люксембург
        604    => 197, // Перу
        48     => 50,  // Бахрейн
        300    => 93,  // Греция
        356    => 108, // Индия
        704    => 75,  // Вьетнам
        156    => 131, // Китай
        608    => 254, // Филиппины
        840    => 283, // США
        428    => 141, // Латвия
        440    => 146, // Литва
        36     => 30,  // Австралия
        788    => 244, // Тунис
        804    => 249, // Украина
        703    => 226, // Словакия
        862    => 72,  // Венесуэла
        702    => 223, // Сингапур
        762    => 235, // Таджикистан
        834    => 237, // Танзания
        716    => 106, // Зимбабве
        31     => 32,  // Азербайджан
        234    => 31,  // Австрия
        242    => 253, // Фиджи
        554    => 179, // Новая Зеландия
        736    => 230, // Судан
        764    => 236, // Таиланд
        858    => 251, // Уругвай
        348    => 71,  // Венгрия
        643693 => 264, // Черногория
        807    => 154, // Македония
        705    => 227, // Словения
        784    => 182, // ОАЭ
        682    => 211, // Сауд. Аравия
        40     => 31,  // Австрия
        191    => 261, // Австрия
        634    => 124, // Катар
        68     => 57,  // Боливия
        188    => 153, // Коста-Рика
        643691 => 113, // Ирландия
        340    => 89,  // Гондурас
        558    => 177, // Никарагуа
        222    => 207, // Сальвадор
        360    => 109, // Индонезия
        422    => 144, // Ливан
        800    => 247, // Уганда
        196    => 126, // Кипр
        818    => 103, // Египет
        504    => 160, // Марокко
        344    => 90,  // Гонконг
        470    => 159, // Мальта
        756    => 267, // Швейцария
        400    => 110, // Иордания
        12     => 35,  // Алжир
        70     => 59,  // Босния и Герцеговина
        478    => 150, // Мавритания
        586    => 191, // Пакистан
        152    => 266, // Чили
        646    => 205, // Руанда
        710    => 276, // ЮАР
        320    => 82,  // Гватемала
        414    => 138, // Кувейт
        686    => 218, // Сенегал
        516    => 171, // Намибия
        566    => 175, // Нигерия
        120    => 122, // Камерун
        192    => 137, // Куба
    ];


    public static function getLocalCountyId($league) {

        $regionId = $league['regionId'];

        if( isset(self::$mapper[$regionId]) ) {
            return self::$mapper[$regionId];
        }

        if( $regionId !== 1) {
            printf("[%s] Notice: Неизвестный regionId: %s, у турнира: %s %s", date('d/M/Y H:i:s'), $regionId, $league['leagueName'], PHP_EOL);
        }

        return $regionId;
    }
}